#+AUTHOR: Pradyumna Swanand Paranjape
#+TITLE: chemacs-profiles
#+STARTUP: overview
#+PROPERTY: header-args :tangle

* Profiles definition
  #+begin_src emacs-lisp :tangle profiles.el
    (("spacemacs" . ((user-emacs-directory . "~/.local/share/pspman/src/spacemacs")
                     (env . (("SPACEMACSDIR" . "~/.local/share/private/src/pradymacs")))))
     ("doom" . ((user-emacs-directory .  "~/.local/share/pspman/src/doom-emacs")
                (env . (("DOOMDIR" . "~/.local/share/private/src/prady_doom"))))))

  #+end_src

* code not working: wrong type stringp
  #+begin_src emacs-lisp :tangle no
    (("spacemacs" . ((user-emacs-directory . (format "%s/%s" (or (getenv "XDG_DATA_HOME")
                                                                  "~/.local/share")
                                                      "pspman/src/spacemacs"))
                      (env . (("SPACEMACSDIR" . (format "%s/%s" (or (getenv "XDG_DATA_HOME")
                                                                    "~/.local/share")
                                                        "private/src/pradymacs"))))))
     (("doom" . ((user-emacs-directory . (format "%s/%s" (or (getenv "XDG_DATA_HOME")
                                                                  "~/.local/share")
                                                      "pspman/src/doom-emacs"))
                      (env . (("DOOMDIR" . (format "%s/%s" (or (getenv "XDG_DATA_HOME")
                                                                    "~/.local/share")
                                                        "private/src/prady_doom"))))))))

  #+end_src

  #+RESULTS:
  | spacemacs                                                                                                                                                                                                        | (user-emacs-directory format %s/%s (or (getenv XDG_DATA_HOME) ~/.local/share) pspman/src/spacemacs) | (env (SPACEMACSDIR format %s/%s (or (getenv XDG_DATA_HOME) ~/.local/share) private/src/pradymacs)) |
  | (doom (user-emacs-directory format %s/%s (or (getenv XDG_DATA_HOME) ~/.local/share) pspman/src/doom-emacs) (env (DOOMDIR format %s/%s (or (getenv XDG_DATA_HOME) ~/.local/share) private/src/prady_doom))) |                                                                                                     |                                                                                                          |


* Default profile in use
  #+begin_src conf :tangle profile
    spacemacs
  #+end_src
